"""Свойства массива
Задание: Создайте любой массив и выведите его форму (размерности),
размер (общее количество элементов) и тип данных элементов массива."""

import numpy as np
# Создание массива
list_numbers = [[2, 4, 6], [8, 10, 12]]
list_numbers = [[2, 4, 6, 8, 10, 12]]
list_numbers = [[[2, 4], [6, 8]], [[10, 12], [12, 13]], [[13, 14], [14, 15]]]
array_2 = np.array(list_numbers, dtype=np.int32)

print("Форма массива:", array_2.shape)
print("Размер массива:", array_2.size)
print("Тип данных массива:", array_2.dtype)
