"""Создание единичной матрицы ( Единичная матрица — это квадратная матрица, 
в которой элементы главной диагонали равны 1, а все остальные элементы равны 0.)
Задача: Создайте единичную матрицу размером 4x4."""


import numpy as np

arr7 = np.eye(4)
print("Единичная матрица 4x4:")
print(arr7)
